Revit 2027 API
ScheduleFieldId Constructor
Initializes a new instance of the ScheduleFieldId class
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ScheduleFieldId(
	int id
)
Public Sub New (
	id As Integer
)
public:
ScheduleFieldId(
	int id
)
new :
        id : int -> ScheduleFieldId
Parameters
id Int32
See Also
Reference
ScheduleFieldId Class
Autodesk.Revit.DB Namespace